leeseunghun057/STM32with8000Hz/STM32H743/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "usb_device.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "usbd_hid.h"
#include <stdio.h>
#include "stm32h7xx_hal_uart.h"
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>
#include "main.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define PIN_NUMBER 16*9
#define KEY_NUMBER 30
#define HOLD_TIME 200 // (ms)
#define DEBOUNCE_TIME 5 // (ms)
#define TAP_DELAY 50 // (us)
#define TAP_DANCE_NUMBER 39

// Keycode are in main.h

#define EXCLUDE_PIN_A4 (1U << 4)

#define COMBO_MAX_LENGTH 10
#define COMBO_NUMBER 1
#define COMBO_TIME 50


/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
typedef struct
{
    uint8_t MODIFIER;
    uint8_t RESERVED;
    uint8_t Keycode1;
    uint8_t Keycode2;
    uint8_t Keycode3;
    uint8_t Keycode4;
    uint8_t Keycode5;
    uint8_t Keycode6;
} HID_SendKeycode;

typedef struct {
    int pinNumber;   // 변경된 핀 번호 (0 ~ 79, 포트 A~E 포함)
    uint8_t pinState; // 핀의 현재 상태 (HIGH: 1, LOW: 0)
} MatrixScanResult;

typedef struct {
    int dance_index;
    bool pressed;
    int count;
    bool activated;
    int last_pressed;
} TapDanceState;

typedef struct {
    int trigger_key_num;
    uint16_t trigger_keys[COMBO_MAX_LENGTH];
    bool trigger_pressed[COMBO_MAX_LENGTH];
    uint16_t keycode;
} Combo;

MatrixScanResult MatrixScan(void);
void KeyboardInit(void);
void SetKeycode(int keycode);
void ResetKeycode(int keycode);
void KeycodeSend();
void LayerOn(int layer);
void LayerOff(int layer);
int GetLayer(int SwitchIndex);
void ReleaseTapDanceLT(int layer, uint16_t keycode, int tdindex);
void ReleaseTapDanceMT(uint16_t modkeycode, uint16_t keycode, int tdindex);
void TapDance(int tdindex, bool pressed);
void TapDanceTask(void);
bool TryComboPress(uint16_t keycode);
void TryRegisterCombo(void);
void ComboTask(void);
void PressSwitch(int SwitchIndex);
void PressKeycode(uint16_t keycode);
void ReleaseSwitch(int SwitchIndex);
void ReleaseKeycode(uint16_t keycode);
void HousekeepingTask (void);
int PinToSwitch(int PinNumber);

HID_SendKeycode keyboardReport = {0};


GPIO_PinState pinState;

int Scanrate = 0; // GPIO 읽기 카운트

uint32_t LastScanrateTimer = 0;

uint16_t Keycode[][KEY_NUMBER] = {
    {
        KC_Y,    TD(1),     TD(2),     KC_U,      KC_J,                      KC_K,    KC_D,     TD(3),     TD(4),     KC_W,
        TD(5),   TD(6),     TD(7),     TD(8),     KC_BSPC,                   KC_M,    TD(9),    TD(10),    TD(11),    TD(12),
        KC_Q,    KC_Z,      KC_SCLN,   KC_A,      KC_ENT,                    KC_B,    KC_F,     KC_G,      KC_V,      KC_X
    },

    {
        KC_Q,    TD(13),    TD(14),    KC_R,      KC_T,                      KC_Y,    KC_U,     TD(15),    TD(16),    KC_P,
        TD(17),  TD(18),    TD(19),    TD(20),    KC_G,                      KC_H,    TD(21),   TD(22),    TD(23),    TD(24),
        KC_Z,    KC_X,      KC_C,      KC_V,      KC_B,                      KC_N,    KC_M,     KC_SPC,    KC_BSPC,   KC_ENT
    },

    {
        KC_GRV,  KC_TRNS,    TD(25),      KC_TRNS,  C(KC_W), KC_TRNS, KC_TRNS,    TD(26),   KC_RALT,     KC_RCTL,
        KC_TAB,  KC_LEFT,    KC_DOWN,     KC_RIGHT, KC_DOT,  KC_DEL,  TD(27),     TD(28),   TD(29),      KC_TRNS,
        KC_ESC,  DF(0),      DF(1),       KC_COMM,  KC_QUOT, KC_TRNS, G(KC_LEFT), G(KC_UP), G(KC_RIGHT), KC_CAPS
    },

    {
        KC_PLUS, TD(30), KC_ASTR, KC_SLSH, KC_PERC, KC_BSLS, KC_LPRN, KC_RPRN, TD(31),  KC_RBRC,
        TD(32),  TD(33), TD(34),  TD(35),  KC_5,    KC_6,    TD(36),  TD(37),  TD(38),  TD(39),
        KC_EXLM, KC_GRV, KC_SCLN, KC_AMPR, KC_QUOT, KC_EQL,  KC_LT,   KC_GT,   KC_LCBR, KC_RCBR
    },

    {
        KC_TRNS, KC_TRNS, KC_TRNS, KC_TRNS, KC_TRNS, KC_TRNS, KC_TRNS, KC_TRNS, KC_TRNS, KC_F12,
        KC_TRNS, KC_TRNS, KC_TRNS, KC_TRNS, KC_TRNS, KC_TRNS, KC_TRNS, KC_TRNS, KC_TRNS, KC_F11,
        KC_F1,   KC_F2,   KC_F3,   KC_F4,   KC_F5,   KC_F6,   KC_F7,   KC_F8,   KC_F9,   KC_F10
    }


};

uint32_t LayerState = 1;
int BaseLayer = 0;

int FromWhichLayer[KEY_NUMBER] = { -1 };

char UART_message[100];

uint32_t DebounceTimer[PIN_NUMBER] = { 0 };

uint32_t gpioA_state = 0; // GPIOA의 모든 핀 상태
uint32_t gpioB_state = 0; // GPIOB의 모든 핀 상태
uint32_t gpioC_state = 0; // GPIOC의 모든 핀 상태
uint32_t gpioD_state = 0; // GPIOD의 모든 핀 상태
uint32_t gpioE_state = 0; // GPIOE의 모든 핀 상태
uint32_t gpioF_state = 0; // GPIOD의 모든 핀 상태
uint32_t gpioG_state = 0; // GPIOE의 모든 핀 상태
uint32_t gpioH_state = 0; // GPIOD의 모든 핀 상태
uint32_t gpioI_state = 0; // GPIOE의 모든 핀 상태

