leeseunghun057/STM32with8000Hz/STM32H743/Core/Src/main.c
uint32_t Last_gpioA_state = 0;
uint32_t Last_gpioB_state = 0;
uint32_t Last_gpioC_state = 0;
uint32_t Last_gpioD_state = 0;
uint32_t Last_gpioE_state = 0;
uint32_t Last_gpioF_state = 0;
uint32_t Last_gpioG_state = 0;
uint32_t Last_gpioH_state = 0;
uint32_t Last_gpioI_state = 0;

uint32_t changedPinA = 0; //변한 값만 1로 바귐
uint32_t changedPinB = 0;
uint32_t changedPinC = 0;
uint32_t changedPinD = 0;
uint32_t changedPinE = 0;
uint32_t changedPinF = 0;
uint32_t changedPinG = 0;
uint32_t changedPinH = 0;
uint32_t changedPinI = 0;

uint32_t CurrentTime = 0;

TapDanceState CurrentTapDance;

Combo combo_list[COMBO_NUMBER] = {{2, {KC_B, KC_C}, {false, false}, KC_D}};
uint16_t combo_pressed_keys[KEY_NUMBER] = {0};
uint32_t last_combo_pressed = 0;

int Matrix[KEY_NUMBER] = { PIN(GPIO_B, GPIO_4),  PIN(GPIO_B, GPIO_3),  PIN(GPIO_A, GPIO_15), PIN(GPIO_A, GPIO_14), PIN(GPIO_A, GPIO_13), PIN(GPIO_B, GPIO_13), PIN(GPIO_B, GPIO_12), PIN(GPIO_B, GPIO_11), PIN(GPIO_B, GPIO_10), PIN(GPIO_B, GPIO_2),
                           PIN(GPIO_B, GPIO_5),  PIN(GPIO_B, GPIO_6),  PIN(GPIO_B, GPIO_9),  PIN(GPIO_B, GPIO_8),  PIN(GPIO_B, GPIO_7),  PIN(GPIO_A, GPIO_5),  PIN(GPIO_A, GPIO_6),  PIN(GPIO_A, GPIO_7),  PIN(GPIO_B, GPIO_0),  PIN(GPIO_B, GPIO_1),
                           PIN(GPIO_C, GPIO_13), PIN(GPIO_C, GPIO_14), PIN(GPIO_C, GPIO_15), PIN(GPIO_F, GPIO_0),  PIN(GPIO_F, GPIO_1),  PIN(GPIO_A, GPIO_0),  PIN(GPIO_A, GPIO_1),  PIN(GPIO_A, GPIO_2),  PIN(GPIO_A, GPIO_3),  PIN(GPIO_A, GPIO_4)};
int PinMap[PIN_NUMBER] = {0};

uint32_t TapDanceTimer[TAP_DANCE_NUMBER] = {0};
int TapDanceCounter[TAP_DANCE_NUMBER] = {0};
bool TapDancePressed[TAP_DANCE_NUMBER] = {false};

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void PeriphCommonClock_Config(void);
static void MX_GPIO_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
extern USBD_HandleTypeDef hUsbDeviceHS;






// GPIO 상태를 스캔하고 변경된 핀 정보를 반환하는 함수
MatrixScanResult MatrixScan(void) {
    // 이전 GPIO 상태를 static으로 유지



    static uint32_t Last_gpioA_state = 0;
    static uint32_t Last_gpioB_state = 0;
    static uint32_t Last_gpioC_state = 0;
    static uint32_t Last_gpioD_state = 0;
    static uint32_t Last_gpioE_state = 0;
    static uint32_t Last_gpioF_state = 0;

    // 현재 GPIO 상태 읽기
    uint32_t gpioA_state = (~(GPIOA->IDR)) & 0b1110000011111111; //& 0b1001111111010000; //핀 마스킹
    uint32_t gpioB_state = (~(GPIOB->IDR)) & 0b0011111111111111; //& 0b1100001111011100;
    uint32_t gpioC_state = (~(GPIOC->IDR)) & 0b1110000000000000; //& 0b1111111111110010;
    uint32_t gpioD_state = (~(GPIOD->IDR)) & 0b0000000000000000; //& 0b1111111111111111;
    uint32_t gpioE_state = (~(GPIOE->IDR)) & 0b0000000000000000; //& 0b1111111111110111;
    uint32_t gpioF_state = (~(GPIOF->IDR)) & 0b0000000000000011; //& 0b1111111111111111;


    // 변경된 비트 계산 (XOR 연산)
    uint32_t changedPinA = gpioA_state ^ Last_gpioA_state;
    uint32_t changedPinB = gpioB_state ^ Last_gpioB_state;
    uint32_t changedPinC = gpioC_state ^ Last_gpioC_state;
    uint32_t changedPinD = gpioD_state ^ Last_gpioD_state;
    uint32_t changedPinE = gpioE_state ^ Last_gpioE_state;
    uint32_t changedPinF = gpioF_state ^ Last_gpioF_state;

    MatrixScanResult result;
    result.pinNumber = -1; // 초기값 (-1: 변경 없음)
    result.pinState = -1;


    // 포트 A~E 순서대로 변경된 핀 확인
    if (changedPinA != 0)
    {
        int bitPosition = -1;
        while ( changedPinA )
        {
            changedPinA >>= 1; // 오른쪽으로 시프트
            bitPosition++;
        }

        result.pinNumber = bitPosition; // 핀 번호 (포트 A는 0 ~ 15)
        result.pinState = (gpioA_state >> bitPosition) & 1; // 현재 상태

        if ( CurrentTime - DebounceTimer[result.pinNumber] > DEBOUNCE_TIME )
        {
        	Last_gpioA_state = gpioA_state;
        	DebounceTimer[result.pinNumber] = CurrentTime;
        }
        else
        {
            result.pinNumber = -1; // 초기값 (-1: 변경 없음)
            result.pinState = -1;
        }
        return result;
    }
    else if ( changedPinB != 0 )
    {
        int bitPosition = -1;
        while ( changedPinB )
        {
            changedPinB >>= 1;
            bitPosition++;
        }

        result.pinNumber = bitPosition + 16; // 핀 번호 (포트 B는 16 ~ 31)
        result.pinState = (gpioB_state >> bitPosition) & 1;

        if ( CurrentTime - DebounceTimer[result.pinNumber] > DEBOUNCE_TIME )
        {
        	Last_gpioB_state = gpioB_state;
        	DebounceTimer[result.pinNumber] = CurrentTime;
        }
        else
        {
            result.pinNumber = -1; // 초기값 (-1: 변경 없음)
            result.pinState = -1;
        }
        return result;
    }
    else if ( changedPinC != 0 )
    {
        int bitPosition = -1;
        while ( changedPinC )
        {
            changedPinC >>= 1;
            bitPosition++;
        }

        result.pinNumber = bitPosition + 32; // 핀 번호 (포트 C는 32 ~ 47)
        result.pinState = (gpioC_state >> bitPosition) & 1;

        if ( CurrentTime - DebounceTimer[result.pinNumber] > DEBOUNCE_TIME )
        {
            Last_gpioC_state = gpioC_state;
            DebounceTimer[result.pinNumber] = CurrentTime;
        }
        else
        {
            result.pinNumber = -1; // 초기값 (-1: 변경 없음)
            result.pinState = -1;
        }
        return result;
    }
    else if ( changedPinD != 0 )
    {
        int bitPosition = -1;
        while ( changedPinD )
        {
            changedPinD >>= 1;
            bitPosition++;
        }

        result.pinNumber = bitPosition + 48; // 핀 번호 (포트 D는 48 ~ 63)
        result.pinState = (gpioD_state >> bitPosition) & 1;

        if ( CurrentTime - DebounceTimer[result.pinNumber] > DEBOUNCE_TIME )
        {
        	Last_gpioD_state = gpioD_state;
        	DebounceTimer[result.pinNumber] = CurrentTime;
        }
        else
        {
            result.pinNumber = -1; // 초기값 (-1: 변경 없음)
            result.pinState = -1;
        }
        return result;
    }
    else if ( changedPinE != 0 )
    {
        int bitPosition = -1;
        while ( changedPinE )
        {
            changedPinE >>= 1;
            bitPosition++;
        }

        result.pinNumber = bitPosition + 64; // 핀 번호 (포트 E는 64 ~ 79)
        result.pinState = (gpioE_state >> bitPosition) & 1;

