leeseunghun057/STM32with8000Hz/STM32H743/Core/Src/main.c
        if ( CurrentTime - DebounceTimer[result.pinNumber] > DEBOUNCE_TIME )
        {
        	Last_gpioE_state = gpioE_state;
        	DebounceTimer[result.pinNumber] = CurrentTime;
        }
        else
        {
            result.pinNumber = -1; // 초기값 (-1: 변경 없음)
            result.pinState = -1;
        }
        return result;
    }
    else if ( changedPinF != 0 )
    {
        int bitPosition = -1;
        while ( changedPinF )
        {
            changedPinF >>= 1;
            bitPosition++;
        }

        result.pinNumber = bitPosition + 80; // 핀 번호 (포트 E는 64 ~ 79)
        result.pinState = (gpioF_state >> bitPosition) & 1;

        if ( CurrentTime - DebounceTimer[result.pinNumber] > DEBOUNCE_TIME )
        {
        	Last_gpioF_state = gpioF_state;
        	DebounceTimer[result.pinNumber] = CurrentTime;
        }
        else
        {
            result.pinNumber = -1; // 초기값 (-1: 변경 없음)
            result.pinState = -1;
        }
        return result;
    }

    return result;
}



void KeyboardInit(void) {
    for(int i=0; i<KEY_NUMBER; ++i) {
        FromWhichLayer[i] = -1;
    }
    CurrentTapDance.dance_index = -1;
    CurrentTapDance.pressed = false;
    CurrentTapDance.count = 0;
    CurrentTapDance.activated = false;
    CurrentTapDance.last_pressed = 0;

    for(int i=0; i<PIN_NUMBER; ++i) {
        PinMap[i] = -1;
    }
    for(int i=0; i<KEY_NUMBER; ++i) {
        PinMap[Matrix[i]] = i;
    }
    return;
}



void SetKeycode(int keycode)
{
    if (keycode == keyboardReport.Keycode1 || keycode == keyboardReport.Keycode2 || keycode == keyboardReport.Keycode3 || keycode == keyboardReport.Keycode4 || keycode == keyboardReport.Keycode5 || keycode == keyboardReport.Keycode6)
    {
        return;
    }

    if (keyboardReport.Keycode1 == 0x00)
    {
        keyboardReport.Keycode1 = keycode;
    }
    else if (keyboardReport.Keycode2 == 0x00)
    {
        keyboardReport.Keycode2 = keycode;
    }
    else if (keyboardReport.Keycode3 == 0x00)
    {
        keyboardReport.Keycode3 = keycode;
    }
    else if (keyboardReport.Keycode4 == 0x00)
    {
        keyboardReport.Keycode4 = keycode;
    }
    else if (keyboardReport.Keycode5 == 0x00)
    {
        keyboardReport.Keycode5 = keycode;
    }
    else if (keyboardReport.Keycode6 == 0x00)
    {
        keyboardReport.Keycode6 = keycode;
    }
    return;
}

void ResetKeycode(int keycode)
{
    if (keyboardReport.Keycode1 == keycode)
    {
        keyboardReport.Keycode1 = 0x00;
    }
    if (keyboardReport.Keycode2 == keycode)
    {
        keyboardReport.Keycode2 = 0x00;
    }
    if (keyboardReport.Keycode3 == keycode)
    {
        keyboardReport.Keycode3 = 0x00;
    }
    if (keyboardReport.Keycode4 == keycode)
    {
        keyboardReport.Keycode4 = 0x00;
    }
    if (keyboardReport.Keycode5 == keycode)
    {
        keyboardReport.Keycode5 = 0x00;
    }
    if (keyboardReport.Keycode6 == keycode)
    {
        keyboardReport.Keycode6 = 0x00;
    }

    return;
}

void KeycodeSend()
{
    USBD_HID_SendReport(&hUsbDeviceHS, (uint8_t *)&keyboardReport, sizeof(keyboardReport));

    return;
}

void LayerOn(int layer) {
    LayerState |= (1<<layer);
    return;
}
void LayerOff(int layer) {
    LayerState &= ~(1<<layer);
    return;
}

int GetLayer(int SwitchIndex)
{
    uint8_t now = 31;
    while (now!=0)
    {
        if( (LayerState&(1<<now)) && (Keycode[now][SwitchIndex]!=KC_TRNS))
        {
            break;
        }
        --now;
    }
    LayerState|=1; //레이어0이 혹시나 꺼졌을 경우 레이어 확인때 자동으로 켜지게

    if(now==0) {
        now=BaseLayer;
    }

    return now;
}

void ReleaseTapDanceLT(int layer, uint16_t keycode, int tdindex) {
    if (TapDanceCounter[tdindex]>=2) {
        ReleaseKeycode(keycode);
    }else{
        LayerOff(layer);
    }
    return;
}

void ReleaseTapDanceMT(uint16_t modkeycode, uint16_t keycode, int tdindex) {
    if (TapDanceCounter[tdindex]>=2) {
        ReleaseKeycode(keycode);
    }else{
        ReleaseKeycode(modkeycode);
    }
    return;
}

void TapDance(int tdindex, bool pressed)
{
    if (pressed) {
        TapDanceTimer[tdindex] = CurrentTime;
        ++TapDanceCounter[tdindex];
        TapDancePressed[tdindex] = pressed;
        return;

    }else {
        // tap의 release의 경우 뗌 시점이 아니라 tapping term이 끝날때 결정되므로 TapDancteTask에서 해결
        if (CurrentTime-TapDanceTimer[tdindex]>=TAPPING_TERM) {
            // Hold시의 release
            switch(tdindex) {
                case 1: ReleaseTapDanceLT(2, KC_P, tdindex); break;
                case 2: ReleaseTapDanceLT(3, KC_O, tdindex); break;
                case 3: ReleaseTapDanceLT(3, KC_L, tdindex); break;
                case 4: ReleaseTapDanceLT(2, KC_C, tdindex); break;
                case 5: ReleaseTapDanceMT(KC_LGUI, KC_I, tdindex); break;
                case 6: ReleaseTapDanceMT(KC_LSFT, KC_N, tdindex); break;
                case 7: ReleaseTapDanceMT(KC_LCTL, KC_E, tdindex); break;
                case 8: ReleaseTapDanceMT(KC_LALT, KC_A, tdindex); break;
                case 9: ReleaseTapDanceMT(KC_LALT, KC_H, tdindex); break;
                case 10: ReleaseTapDanceMT(KC_LCTL, KC_T, tdindex); break;
                case 11: ReleaseTapDanceMT(KC_LSFT, KC_S, tdindex); break;
                case 12: ReleaseTapDanceMT(KC_LGUI, KC_R, tdindex); break;
                case 13: ReleaseTapDanceLT(2, KC_W, tdindex); break;
                case 14: ReleaseTapDanceLT(3, KC_E, tdindex); break;
                case 15: ReleaseTapDanceLT(3, KC_I, tdindex); break;
                case 16: ReleaseTapDanceLT(2, KC_O, tdindex); break;
                case 17: ReleaseTapDanceMT(KC_LGUI, KC_A, tdindex); break;
                case 18: ReleaseTapDanceMT(KC_LSFT, KC_S, tdindex); break;
                case 19: ReleaseTapDanceMT(KC_LCTL, KC_D, tdindex); break;
                case 20: ReleaseTapDanceMT(KC_LALT, KC_F, tdindex); break;
                case 21: ReleaseTapDanceMT(KC_LALT, KC_J, tdindex); break;
                case 22: ReleaseTapDanceMT(KC_LCTL, KC_K, tdindex); break;
                case 23: ReleaseTapDanceMT(KC_LSFT, KC_L, tdindex); break;
                case 24: ReleaseTapDanceMT(KC_LGUI, KC_SCLN, tdindex); break;
                case 25: ReleaseTapDanceLT(4, KC_UP, tdindex); break;
                case 26: ReleaseTapDanceLT(4, KC_PGUP, tdindex); break;
                case 27: ReleaseTapDanceMT(KC_LALT, KC_HOME, tdindex); break;
                case 28: ReleaseTapDanceMT(KC_LCTL, KC_PGDN, tdindex); break;
                case 29: ReleaseTapDanceMT(KC_LSFT, KC_END, tdindex); break;
                case 30: ReleaseTapDanceLT(4, KC_MINS, tdindex); break;
                case 31: ReleaseTapDanceLT(4, KC_LBRC, tdindex); break;
                case 32: ReleaseTapDanceMT(KC_LGUI, KC_1, tdindex); break;
                case 33: ReleaseTapDanceMT(KC_LSFT, KC_2, tdindex); break; 
                case 34: ReleaseTapDanceMT(KC_LCTL, KC_3, tdindex); break;
                case 35: ReleaseTapDanceMT(KC_LALT, KC_4, tdindex); break;
                case 36: ReleaseTapDanceMT(KC_LALT, KC_7, tdindex); break;
                case 37: ReleaseTapDanceMT(KC_LCTL, KC_8, tdindex); break;
                case 38: ReleaseTapDanceMT(KC_LSFT, KC_9, tdindex); break;
                case 39: ReleaseTapDanceMT(KC_LGUI, KC_0, tdindex); break;
                default: break;
            }
            TapDanceTimer[tdindex] = 0;
            TapDanceCounter[tdindex] = 0;
        }
        TapDancePressed[tdindex] = pressed;
        return;
    }
    return;
}

