leeseunghun057/STM32with8000Hz/STM32H743/Core/Src/main.c
void TapDanceTask(void) {
    for (int i=0; i<TAP_DANCE_NUMBER; ++i) {
        if(TapDanceCounter[i]!=0 && (CurrentTime-TapDanceTimer[i])>=TAPPING_TERM) {
            switch(i) {
                case 1: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        LayerOn(2);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_P);
                    }else {
                        PressKeycode(KC_P);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_P);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                case 2: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        LayerOn(3);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_O);
                    }else {
                        PressKeycode(KC_O);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_O);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                case 3: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        LayerOn(3);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_L);
                    }else {
                        PressKeycode(KC_L);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_L);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                case 4: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        LayerOn(2);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_C);
                    }else {
                        PressKeycode(KC_C);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_C);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                case 5: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        PressKeycode(KC_LGUI);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_I);
                    }else {
                        PressKeycode(KC_I);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_I);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                case 6: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        PressKeycode(KC_LSFT);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_N);
                    }else {
                        PressKeycode(KC_N);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_N);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                case 7: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        PressKeycode(KC_LCTL);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_E);
                    }else {
                        PressKeycode(KC_E);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_E);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                case 8: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        PressKeycode(KC_LALT);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_SPC);
                    }else {
                        PressKeycode(KC_SPC);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_SPC);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                case 9: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        PressKeycode(KC_LALT);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_H);
                    }else {
                        PressKeycode(KC_H);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_H);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                case 10: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        PressKeycode(KC_LCTL);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_T);
                    }else {
                        PressKeycode(KC_T);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_T);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                case 11: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        PressKeycode(KC_LSFT);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_S);
                    }else {
                        PressKeycode(KC_S);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_S);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                case 12: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        PressKeycode(KC_LGUI);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_R);
                    }else {
                        PressKeycode(KC_R);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_R);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                case 13: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        LayerOn(2);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_W);
                    }else {
                        PressKeycode(KC_W);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_W);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                case 14: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        LayerOn(3);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_E);
                    }else {
                        PressKeycode(KC_E);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_E);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                case 15: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        LayerOn(3);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_I);
                    }else {
                        PressKeycode(KC_I);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_I);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                case 16: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        LayerOn(2);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_O);
                    }else {
                        PressKeycode(KC_O);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_O);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                case 17: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        PressKeycode(KC_LGUI);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_A);
                    }else {
                        PressKeycode(KC_A);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_A);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                case 18: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        PressKeycode(KC_LSFT);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_S);
                    }else {
                        PressKeycode(KC_S);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_S);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                case 19: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        PressKeycode(KC_LCTL);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_D);
                    }else {
                        PressKeycode(KC_D);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_D);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                case 20: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        PressKeycode(KC_LALT);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_F);
                    }else {
                        PressKeycode(KC_F);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_F);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                case 21: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        PressKeycode(KC_LALT);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_J);
                    }else {
                        PressKeycode(KC_J);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_J);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                case 22: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        PressKeycode(KC_LCTL);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_K);
                    }else {
                        PressKeycode(KC_K);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_K);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                case 23: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        PressKeycode(KC_LSFT);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_L);
                    }else {
                        PressKeycode(KC_L);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_L);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                case 24: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        PressKeycode(KC_LGUI);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_SCLN);
                    }else {
                        PressKeycode(KC_SCLN);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_SCLN);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                case 25: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        LayerOn(4);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_UP);
                    }else {
                        PressKeycode(KC_UP);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_UP);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                case 26: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        LayerOn(4);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_PGUP);
                    }else {
                        PressKeycode(KC_PGUP);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_PGUP);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                case 27: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        PressKeycode(KC_HOME);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_J);
                    }else {
                        PressKeycode(KC_J);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_J);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                case 28: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        PressKeycode(KC_LCTL);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_PGDN);
                    }else {
                        PressKeycode(KC_PGDN);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_PGDN);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                case 29: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        PressKeycode(KC_LSFT);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_END);
                    }else {
                        PressKeycode(KC_END);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_END);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                case 30: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        LayerOn(4);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_MINS);
                    }else {
                        PressKeycode(KC_MINS);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_MINS);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                case 31: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        LayerOn(4);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_LBRC);
                    }else {
                        PressKeycode(KC_LBRC);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_LBRC);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                case 32: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        PressKeycode(KC_LGUI);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_1);
                    }else {
                        PressKeycode(KC_1);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_1);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                case 33: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        PressKeycode(KC_LSFT);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_2);
                    }else {
                        PressKeycode(KC_2);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_2);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                case 34: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        PressKeycode(KC_LCTL);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_3);
                    }else {
                        PressKeycode(KC_3);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_3);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                case 35: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        PressKeycode(KC_LALT);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_4);
                    }else {
                        PressKeycode(KC_4);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_4);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                case 36: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        PressKeycode(KC_LALT);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_7);
                    }else {
                        PressKeycode(KC_7);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_7);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                case 37: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        PressKeycode(KC_LCTL);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_8);
                    }else {
                        PressKeycode(KC_8);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_8);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
