leeseunghun057/STM32with8000Hz/STM32H743/Core/Src/main.c
                case 38: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        PressKeycode(KC_LSFT);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_9);
                    }else {
                        PressKeycode(KC_9);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_9);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                case 39: {
                    if (TapDancePressed[i] && TapDanceCounter[i]==1) {
                        PressKeycode(KC_LGUI);
                    }else if(TapDanceCounter[i]>=2) {
                        PressKeycode(KC_0);
                    }else {
                        PressKeycode(KC_0);
                        KeycodeSend();
                        HAL_Delay(TAP_DELAY);
                        ReleaseKeycode(KC_0);
                        KeycodeSend();
                        TapDanceCounter[i] = 0;
                        TapDanceTimer[i] = 0;
                    }
                    break;
                }
                default: {
                    break;
                }
            }
        }
    }

    if (CurrentTapDance.activated) {
        // do tap dance things
        
        CurrentTapDance.dance_index = -1;
        CurrentTapDance.activated = false;
        CurrentTapDance.count = 0;
        CurrentTapDance.pressed = false;
    }
    return;
}

bool TryComboPress(uint16_t keycode) {
    bool is_combo_key = false;
    #ifdef COMBO_STRICT_ORDER
    for (int i=0; i<COMBO_NUMBER; ++i) {
        for (int j==0; j<combo_list[i].trigger_key_num; ++j) {
            if (combo_list[i].trigger_pressed[j]) continue;
            if (combo_list[i].trigger_keys[j] == keycode) {
                is_combo_key = true;
                combo_list[i].trigger_pressed[j] = true;
            }
            break;
        }
    }
    #else // not COMBO_STRICT_ORDER
    int pressed_combo_keys_num = 0;

    while (pressed_combo_keys_num<COMBO_MAX_LENGTH && combo_pressed_keys[pressed_combo_keys_num]!=0) ++pressed_combo_keys_num;

    for (int i=0; i<COMBO_NUMBER; ++i) {
        if (combo_list[i].trigger_key_num>pressed_combo_keys_num) continue;

        is_combo_key = false;
        for (int j=0; j<pressed_combo_keys_num; ++j) {
            bool exist_in_list = false;
            for (int k=0; k<combo_list[i].trigger_key_num; ++k) {
                if (combo_list[i].trigger_keys[k]==combo_pressed_keys[j]) {
                    exist_in_list=true;
                    combo_list[i].trigger_pressed[k] = true;
                    break;
                }
            }
            is_combo_key |= exist_in_list;
        }
    }
    #endif // COMBO_STRICT_ORDER

    return is_combo_key;
}

void TryRegisterCombo(void) {
#ifdef COMBO_STRICT_ORDER
    for (int i=0; i<COMBO_NUMBER; ++i) {
        if (combo_list[i].trigger_pressed[combo_list[i].trigger_key_num]) {
            PressKeycode(combo_list[i].keycode);
            for (int j=0; j<COMBO_MAX_LENGTH; ++j) {
                combo_pressed_keys[j] = 0;
                combo_list[i].trigger_pressed[j] = false;
            }
        }
    }
    return;
#else // not COMBO_STRICT_ORDER
    for (int i=0; i<COMBO_NUMBER; ++i) {
        bool trigger = true;
        for (int j=0; j<combo_list[i].trigger_key_num; ++j) {
            if (!combo_list[i].trigger_pressed[j]) {
                trigger = false;
                break;
            }
        }
        if (trigger) {
            PressKeycode(combo_list[i].keycode);
            for (int j=0; j<COMBO_MAX_LENGTH; ++j) {
                combo_pressed_keys[j] = 0;
                combo_list[i].trigger_pressed[j] = false;
            }
        }

    }
    return;
#endif // COMBO_STRICT_ORDER
}

void ComboTask(void) {
    uint32_t now=HAL_GetTick();
    if (now-last_combo_pressed>COMBO_TIME) {
        for (int i=0; i<COMBO_MAX_LENGTH; ++i) {
            if (combo_pressed_keys[i]!=0) {
                PressKeycode(combo_pressed_keys[i]);
                combo_pressed_keys[i] = 0;
                KeycodeSend();
                HAL_Delay(TAP_DELAY);
            }
        }
        for (int i=0; i<COMBO_NUMBER; ++i) {
            for (int j=0; j<COMBO_MAX_LENGTH; ++j) {
                combo_pressed_keys[j] = 0;
                combo_list[i].trigger_pressed[j] = false;
            }
        }
    }
    return;
}

void PressSwitch(int SwitchIndex) {
    if(SwitchIndex==-1) {return;}

    int layer = GetLayer(SwitchIndex);

    FromWhichLayer[SwitchIndex] = layer;

    if(TryComboPress(Keycode[layer][SwitchIndex])) {
        last_combo_pressed = HAL_GetTick();
        for (int i=0; i<COMBO_MAX_LENGTH; ++i) {
            if (combo_pressed_keys[i]==0) {
                combo_pressed_keys[i] = Keycode[layer][SwitchIndex];
                break;
            }
        }
        TryRegisterCombo();
        return;
    }

    PressKeycode(Keycode[layer][SwitchIndex]);
    return;
}

void PressKeycode(uint16_t keycode)
{
    if (keycode==0||keycode==1) return;

    // 콤보 가능성 없는 키가 들어오면 콤보가 깨지도록
    if (combo_pressed_keys[0] != 0) {
        last_combo_pressed = 0;
        ComboTask();
    }

	if (IS_MOD(keycode))
	{
		keyboardReport.MODIFIER = keyboardReport.MODIFIER | (1<<(keycode - KC_MOD_MIN));
	}
	else if (IS_FN(keycode) || IS_TD(keycode))
	{

		if ( IS_FN(keycode) )
		{
            LayerState|=(1<<FN_TO_LAYER(keycode));
		}
		else if ( IS_TD(keycode))
		{
			TapDance(TD_TO_INDEX(keycode), true);
		}



	}else if (IS_DF(keycode)){
        BaseLayer=DF_TO_LAYER(keycode);
    }
	else
	{
		SetKeycode(keycode);
	}

    return;
}


void ReleaseSwitch(int SwitchIndex)
{
    if(SwitchIndex==-1) {return;}
    int layer = FromWhichLayer[SwitchIndex];
    ReleaseKeycode(Keycode[layer][SwitchIndex]);
    FromWhichLayer[SwitchIndex] = -1;
    return;
}


void ReleaseKeycode(uint16_t keycode)
{
    if (keycode==KC_NO || keycode==KC_TRNS)
    {
        return;
    }

